; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	infrared5 - mode
	thermograph4 - mode
	image0 - mode
	image6 - mode
	thermograph2 - mode
	image7 - mode
	infrared3 - mode
	infrared1 - mode
	Star1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star0 - direction
	Star2 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 image7)
	(supports instrument0 image6)
	(supports instrument0 infrared5)
	(supports instrument0 infrared1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
	(supports instrument1 image0)
	(supports instrument1 image7)
	(supports instrument1 thermograph4)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star0)
	(supports instrument2 infrared5)
	(calibration_target instrument2 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
)
(:goal (and
	(have_image Phenomenon5 infrared3)
	(have_image Phenomenon5 infrared5)
	(have_image Planet6 infrared5)
	(have_image Planet6 infrared3)
	(have_image Planet7 image0)
	(have_image Planet7 thermograph2)
	(have_image Star8 image6)
	(have_image Star8 infrared1)
	(have_image Phenomenon9 image6)
	(have_image Planet10 image7)
	(have_image Planet10 image0)
	(have_image Phenomenon11 thermograph2)
	(have_image Phenomenon12 image7)
	(have_image Phenomenon12 thermograph2)
))

)

; plan
1. (turn_to satellite1 star0 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star0)
   goals met: 0 of 14
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 14
3. (calibrate satellite1 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 14
4. (turn_to satellite1 planet7 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet7)
   goals met: 0 of 14
5. (take_image satellite1 planet7 instrument1 image0)
   added: (have_image planet7 image0)
   goals met: 1 of 14
6. (turn_to satellite1 planet6 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet6)
   goals met: 1 of 14
7. (take_image satellite1 planet6 instrument1 infrared3)
   added: (have_image planet6 infrared3)
   goals met: 2 of 14
8. (turn_to satellite1 phenomenon5 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 phenomenon5)
   goals met: 2 of 14
9. (turn_to satellite0 groundstation4 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 groundstation4)
   goals met: 2 of 14
10. (take_image satellite1 phenomenon5 instrument1 infrared3)
   added: (have_image phenomenon5 infrared3)
   goals met: 3 of 14
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 14
12. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 3 of 14
13. (turn_to satellite0 phenomenon11 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 14
14. (take_image satellite0 phenomenon11 instrument0 thermograph2)
   added: (have_image phenomenon11 thermograph2)
   goals met: 4 of 14
15. (turn_to satellite0 phenomenon12 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon12)
   goals met: 4 of 14
16. (take_image satellite0 phenomenon12 instrument0 image7)
   added: (have_image phenomenon12 image7)
   goals met: 5 of 14
17. (take_image satellite0 phenomenon12 instrument0 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 6 of 14
18. (turn_to satellite0 phenomenon5 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon5)
   goals met: 6 of 14
19. (take_image satellite0 phenomenon5 instrument0 infrared5)
   added: (have_image phenomenon5 infrared5)
   goals met: 7 of 14
20. (turn_to satellite0 phenomenon9 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon9)
   goals met: 7 of 14
21. (take_image satellite0 phenomenon9 instrument0 image6)
   added: (have_image phenomenon9 image6)
   goals met: 8 of 14
22. (turn_to satellite0 planet6 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet6)
   goals met: 8 of 14
23. (take_image satellite0 planet6 instrument0 infrared5)
   added: (have_image planet6 infrared5)
   goals met: 9 of 14
24. (turn_to satellite0 planet7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet7)
   goals met: 9 of 14
25. (take_image satellite0 planet7 instrument0 thermograph2)
   added: (have_image planet7 thermograph2)
   goals met: 10 of 14
26. (turn_to satellite0 star8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star8)
   goals met: 10 of 14
27. (take_image satellite0 star8 instrument0 image6)
   added: (have_image star8 image6)
   goals met: 11 of 14
28. (take_image satellite0 star8 instrument0 infrared1)
   added: (have_image star8 infrared1)
   goals met: 12 of 14
29. (turn_to satellite1 planet10 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 planet10)
   goals met: 12 of 14
30. (take_image satellite1 planet10 instrument1 image0)
   added: (have_image planet10 image0)
   goals met: 13 of 14
31. (take_image satellite1 planet10 instrument1 image7)
   added: (have_image planet10 image7)
   goals met: 14 of 14
